#Задача 2: Найдите сумму цифр трехзначного числа.
#*Пример:*
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |

#n = int(input('Enter three-digit number: '))
#a = n // 100
#b = n // 10 % 10
#c = n % 10
#print(a + b + c)


#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
#Вместе они сделали S журавликов. Сколько журавликов сделал 
#каждый ребенок, если известно, что Петя и Сережа сделали одинаковое 
#количество журавликов, а Катя сделала в два раза больше журавликов, 
#чем Петя и Сережа вместе?
#*Пример:*
#6 -> 1  4  1
#24 -> 4  16  4
#    60 -> 10  40  10

#s = int(input('Enter number of cranes: '))
#print(int(s / 6), int(s * 2 / 3), int(s / 6))


